unicab369/ch32mess/ch32fun/ch57xhw.h
#define SysTick                    ((SysTick_Type *) SysTick_BASE)
#define SYSTICK_LOAD_RELOAD_MSK    (0xFFFFFFFFFFFFFFFF)
#define SYSTICK_CTLR_SWIE          (1 << 31)
#define SYSTICK_CTLR_INIT          (1 << 5)
#define SYSTICK_CTLR_MODE          (1 << 4)
#define SYSTICK_CTLR_STRE          (1 << 3)
#define SYSTICK_CTLR_STCLK         (1 << 2)
#define SYSTICK_CTLR_STIE          (1 << 1)
#define SYSTICK_CTLR_STE           (1 << 0)
#define SYSTICK_SR_CNTIF           (1 << 0)

typedef enum
{
#if MCU_PACKAGE == 3 // CH573
	 CLK_SOURCE_LSI = 0x00,
	 CLK_SOURCE_LSE,

	 CLK_SOURCE_HSE_8MHz = 0x24,
	 CLK_SOURCE_HSE_6_4MHz = 0x25,
	 CLK_SOURCE_HSE_4MHz = 0x28,
	 CLK_SOURCE_HSE_2MHz = (0x20 | 16),
	 CLK_SOURCE_HSE_1MHz = (0x20 | 0),

	 CLK_SOURCE_PLL_60MHz = 0x48,
	 CLK_SOURCE_PLL_48MHz = (0x40 | 10),
	 CLK_SOURCE_PLL_40MHz = (0x40 | 12),
	 CLK_SOURCE_PLL_36_9MHz = (0x40 | 13),
	 CLK_SOURCE_PLL_32MHz = (0x40 | 15),
	 CLK_SOURCE_PLL_30MHz = (0x40 | 16),
	 CLK_SOURCE_PLL_24MHz = (0x40 | 20),
	 CLK_SOURCE_PLL_20MHz = (0x40 | 24),
	 CLK_SOURCE_PLL_15MHz = (0x40 | 0),
#else
	CLK_SOURCE_LSI = 0xC0,

	CLK_SOURCE_HSE_16MHz = (0x02),
	CLK_SOURCE_HSE_8MHz = (0x04),
	CLK_SOURCE_HSE_6_4MHz = (0x05),
	CLK_SOURCE_HSE_4MHz = (0x08),
	CLK_SOURCE_HSE_2MHz = (0x10),
	CLK_SOURCE_HSE_1MHz = (0x0),

	CLK_SOURCE_PLL_100MHz = (0x40 | 6),
	CLK_SOURCE_PLL_75MHz = (0x40 | 8),
	CLK_SOURCE_PLL_60MHz = (0x40 | 10),
	CLK_SOURCE_PLL_50MHz = (0x40 | 12),
	CLK_SOURCE_PLL_40MHz = (0x40 | 15),
	CLK_SOURCE_PLL_30MHz = (0x40 | 20),
	CLK_SOURCE_PLL_25MHz = (0x40 | 24),
	CLK_SOURCE_PLL_24MHz = (0x40 | 25),
	CLK_SOURCE_PLL_20MHz = (0x40 | 30),
#endif
} SYS_CLKTypeDef;

// For debug writing to the debug interface.
#if MCU_PACKAGE == 3 // CH573
#define DMDATA0 			((vu32*)0xe0000380)
#define DMDATA1 			((vu32*)0xe0000384)
#define DMSTATUS_SENTINEL	((vu32*)0xe0000388)// Reads as 0x00000000 if debugger is attached.
#else
#define DMDATA0 			((vu32*)0xe0000340)
#define DMDATA1 			((vu32*)0xe0000344)
#define DMSTATUS_SENTINEL	((vu32*)0xe0000348)// Reads as 0x00000000 if debugger is attached.
#endif

/* System: clock configuration register */
#define R32_CLK_SYS_CFG     (*((vu32*)0x40001008))    // RWA, system clock configuration, SAM
#define R8_CLK_SYS_CFG      (*((vu8*)0x40001008))     // RWA, system clock configuration, SAM
#define  RB_CLK_SYS_MOD     0xC0                      // RWA, system clock source mode: 00/10=divided from 32MHz, 01=divided from PLL-600MHz,11=directly from LSI
#define  RB_CLK_PLL_DIV     0x1F                      // RWA, output clock divider from PLL or CK32M
#define  RB_TX_32M_PWR_EN   0x40000                   // RWA, extern 32MHz HSE power contorl
#define  RB_PLL_PWR_EN      0x100000                  // RWA, PLL power control
#define R8_HFCK_PWR_CTRL    (*((vu8*)0x4000100A))     // RWA, power configuration for system high clock, SAM
#define  RB_CLK_PLL_PON     0x10                      // RWA, PLL power control
#define  RB_CLK_XT32M_KEEP  0x08                      // RWA, RWA, disable auto closing when in halt mode
#define  RB_CLK_XT32M_PON   0x04                      // RWA, extern 32MHz HSE power contorl


/* System: safe accessing register */
#define R32_SAFE_ACCESS     (*((vu32*)0x40001040)) // RW, safe accessing
#define R8_SAFE_ACCESS_SIG  (*((vu8*)0x40001040))  // WO, safe accessing sign register, must write SAFE_ACCESS_SIG1 then SAFE_ACCESS_SIG2 to enter safe accessing mode
#define  RB_SAFE_ACC_MODE   0x03                      // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#define  RB_SAFE_ACC_ACT    0x04                      // RO, indicate safe accessing on
#define  RB_SAFE_ACC_TIMER  0xF8                      // RO, safe accessing mode closed
#define SAFE_ACCESS_SIG1    0x57                      // WO: safe accessing sign value step 1
#define SAFE_ACCESS_SIG2    0xA8                      // WO: safe accessing sign value step 2
#define SAFE_ACCESS_SIG0    0x00                      // WO: safe accessing sign value for disable
#define R8_CHIP_ID          (*((vu8*)0x40001041))  // RF, chip ID register, always is ID_CH57*
#define SYS_SAFE_ACCESS(a)  do { R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG1; \
								 R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG2; \
								 asm volatile ("nop\nnop"); \
								 {a} \
								 R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG0; \
								 asm volatile ("nop\nnop"); } while(0)

/*System: Miscellaneous Control register */
#define R32_MISC_CTRL       (*((vu32*)0x40001048)) // RWA, miscellaneous control register
#define R8_PLL_CONFIG       (*((vu8*)0x4000104B))  // RWA, PLL configuration control, SAM
#define  RB_PLL_CFG_DAT     0x7F                      // RWA, PLL configuration control, SAM

/* System: 32MHz oscillator control register */
#define R8_XT32M_TUNE       (*((vu8*)0x4000104E))  // RWA, external 32MHz oscillator tune control, SAM
#define  RB_XT32M_C_LOAD    0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF
#define  RB_XT32M_I_BIAS    0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current

/* System: Flash ROM control register */
#define R32_FLASH_DATA      (*((vu32*)0x40001800)) // RO/WO, flash ROM data
#define R32_FLASH_CONTROL   (*((vu32*)0x40001804)) // RW, flash ROM control, byte1 and byte3 need RWA
#define R8_FLASH_DATA       (*((vu8*)0x40001804))  // RO/WO, flash ROM data buffer
#define R8_FLASH_SCK        (*((vu8*)0x40001805))  // RW, flash ROM sck time config
#define R8_FLASH_CTRL       (*((vu8*)0x40001806))  // RW, flash ROM access control
#define R8_FLASH_CFG        (*((vu8*)0x40001807))  // RWA, flash ROM access config, SAM

/* GPIO PA register */
#define R32_PA_DIR          (*((vu32*)0x400010A0)) // RW, GPIO PA I/O direction: 0=in, 1=out
#define R32_PA_PIN          (*((vu32*)0x400010A4)) // RO, GPIO PA input
#define R32_PA_OUT          (*((vu32*)0x400010A8)) // RW, GPIO PA output
#define R32_PA_CLR          (*((vu32*)0x400010AC)) // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R32_PA_PU           (*((vu32*)0x400010B0)) // RW, GPIO PA pullup resistance enable
#define R32_PA_PD_DRV       (*((vu32*)0x400010B4)) // RW, PA pulldown for input or PA driving capability for output
#define R32_PA_SET          (*((vu32*)0x400010B8)) // RW, PA set high for output ,1=set output high,0=IDLE

/* GPIO PB register */
#define R32_PB_DIR          (*((vu32*)0x400010C0)) // RW, GPIO PB I/O direction: 0=in, 1=out
#define R32_PB_PIN          (*((vu32*)0x400010C4)) // RO, GPIO PB input
#define R32_PB_OUT          (*((vu32*)0x400010C8)) // RW, GPIO PB output
#define R32_PB_CLR          (*((vu32*)0x400010CC)) // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R32_PB_PU           (*((vu32*)0x400010D0)) // RW, GPIO PB pullup resistance enable
#define R32_PB_PD_DRV       (*((vu32*)0x400010D4)) // RW, PB pulldown for input or PB driving capability for output
#define R32_PB_SET          (*((vu32*)0x400010D8)) // RW, PB set high for output ,1=set output high,0=IDLE

#define PA0      (0x00000001) /*!< Pin 0 selected */
#define PA1      (0x00000002) /*!< Pin 1 selected */
#define PA2      (0x00000004) /*!< Pin 2 selected */
#define PA3      (0x00000008) /*!< Pin 3 selected */
#define PA4      (0x00000010) /*!< Pin 4 selected */
#define PA5      (0x00000020) /*!< Pin 5 selected */
#define PA6      (0x00000040) /*!< Pin 6 selected */
#define PA7      (0x00000080) /*!< Pin 7 selected */
#define PA8      (0x00000100) /*!< Pin 8 selected */
#define PA9      (0x00000200) /*!< Pin 9 selected */
#define PA10     (0x00000400) /*!< Pin 10 selected */
#define PA11     (0x00000800) /*!< Pin 11 selected */
#define PA12     (0x00001000) /*!< Pin 12 selected */
#define PA13     (0x00002000) /*!< Pin 13 selected */
#define PA14     (0x00004000) /*!< Pin 14 selected */
#define PA15     (0x00008000) /*!< Pin 15 selected */

#define PB       (0x80000000) /* Bit mask to indicate bank B */
#define PB0      (0x80000001) /*!< Pin 0 selected */
#define PB1      (0x80000002) /*!< Pin 1 selected */
#define PB2      (0x80000004) /*!< Pin 2 selected */
#define PB3      (0x80000008) /*!< Pin 3 selected */
#define PB4      (0x80000010) /*!< Pin 4 selected */
#define PB5      (0x80000020) /*!< Pin 5 selected */
#define PB6      (0x80000040) /*!< Pin 6 selected */
#define PB7      (0x80000080) /*!< Pin 7 selected */
#define PB8      (0x80000100) /*!< Pin 8 selected */
#define PB9      (0x80000200) /*!< Pin 9 selected */
#define PB10     (0x80000400) /*!< Pin 10 selected */
#define PB11     (0x80000800) /*!< Pin 11 selected */
#define PB12     (0x80001000) /*!< Pin 12 selected */
#define PB13     (0x80002000) /*!< Pin 13 selected */
#define PB14     (0x80004000) /*!< Pin 14 selected */
#define PB15     (0x80008000) /*!< Pin 15 selected */
#define PB16     (0x80010000) /*!< Pin 16 selected */
#define PB17     (0x80020000) /*!< Pin 17 selected */
#define PB18     (0x80040000) /*!< Pin 18 selected */
#define PB19     (0x80080000) /*!< Pin 19 selected */
#define PB20     (0x80100000) /*!< Pin 20 selected */
#define PB21     (0x80200000) /*!< Pin 21 selected */
#define PB22     (0x80400000) /*!< Pin 22 selected */
#define PB23     (0x80800000) /*!< Pin 23 selected */
#define P_All    (0xFFFFFFFF) /*!< All pins selected */

/* UART0 register */
#define R32_UART0_CTRL      (*((vu32*)0x40003000)) // RW, UART0 control
#define R8_UART0_MCR        (*((vu8*)0x40003000))  // RW, UART0 modem control
#define R8_UART0_IER        (*((vu8*)0x40003001))  // RW, UART0 interrupt enable
#define R8_UART0_FCR        (*((vu8*)0x40003002))  // RW, UART0 FIFO control
#define R8_UART0_LCR        (*((vu8*)0x40003003))  // RW, UART0 line control
#define R32_UART0_STAT      (*((vu32*)0x40003004)) // RO, UART0 status
#define R8_UART0_IIR        (*((vu8*)0x40003004))  // RO, UART0 interrupt identification
#define R8_UART0_LSR        (*((vu8*)0x40003005))  // RO, UART0 line status
#define R8_UART0_MSR        (*((vu8*)0x40003006))  // RO, UART0 modem status
#define R32_UART0_FIFO      (*((vu32*)0x40003008)) // RW, UART0 data or FIFO port
#define R8_UART0_RBR        (*((vu8*)0x40003008))  // RO, UART0 receiver buffer, receiving byte
#define R8_UART0_THR        (*((vu8*)0x40003008))  // WO, UART0 transmitter holding, transmittal byte
#define R8_UART0_RFC        (*((vu8*)0x4000300A))  // RO, UART0 receiver FIFO count
#define R8_UART0_TFC        (*((vu8*)0x4000300B))  // RO, UART0 transmitter FIFO count
#define R32_UART0_SETUP     (*((vu32*)0x4000300C)) // RW, UART0 setup
#define R16_UART0_DL        (*((vu16*)0x4000300C)) // RW, UART0 divisor latch
#define R8_UART0_DLL        (*((vu8*)0x4000300C))  // RW, UART0 divisor latch LSB byte
#define R8_UART0_DLM        (*((vu8*)0x4000300D))  // RW, UART0 divisor latch MSB byte
#define R8_UART0_DIV        (*((vu8*)0x4000300E))  // RW, UART0 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART0_ADR        (*((vu8*)0x4000300F))  // RW, UART0 slave address: 0xFF=disable, other=enable

/* UART1 register */
#define R32_UART1_CTRL      (*((vu32*)0x40003400)) // RW, UART1 control
#define R8_UART1_MCR        (*((vu8*)0x40003400))  // RW, UART1 modem control
#define R8_UART1_IER        (*((vu8*)0x40003401))  // RW, UART1 interrupt enable
#define R8_UART1_FCR        (*((vu8*)0x40003402))  // RW, UART1 FIFO control
#define R8_UART1_LCR        (*((vu8*)0x40003403))  // RW, UART1 line control
#define R32_UART1_STAT      (*((vu32*)0x40003404)) // RO, UART1 status
#define R8_UART1_IIR        (*((vu8*)0x40003404))  // RO, UART1 interrupt identification
#define R8_UART1_LSR        (*((vu8*)0x40003405))  // RO, UART1 line status
#define R32_UART1_FIFO      (*((vu32*)0x40003408)) // RW, UART1 data or FIFO port
#define R8_UART1_RBR        (*((vu8*)0x40003408))  // RO, UART1 receiver buffer, receiving byte
#define R8_UART1_THR        (*((vu8*)0x40003408))  // WO, UART1 transmitter holding, transmittal byte
#define R8_UART1_RFC        (*((vu8*)0x4000340A))  // RO, UART1 receiver FIFO count
#define R8_UART1_TFC        (*((vu8*)0x4000340B))  // RO, UART1 transmitter FIFO count
#define R32_UART1_SETUP     (*((vu32*)0x4000340C)) // RW, UART1 setup
#define R16_UART1_DL        (*((vu16*)0x4000340C)) // RW, UART1 divisor latch
#define R8_UART1_DLL        (*((vu8*)0x4000340C))  // RW, UART1 divisor latch LSB byte
#define R8_UART1_DLM        (*((vu8*)0x4000340D))  // RW, UART1 divisor latch MSB byte
#define R8_UART1_DIV        (*((vu8*)0x4000340E))  // RW, UART1 pre-divisor latch byte, only low 7 bit, from 1 to 0/128

/* UART2 register */
#define R32_UART2_CTRL      (*((vu32*)0x40003800)) // RW, UART2 control
#define R8_UART2_MCR        (*((vu8*)0x40003800))  // RW, UART2 modem control
#define R8_UART2_IER        (*((vu8*)0x40003801))  // RW, UART2 interrupt enable
#define R8_UART2_FCR        (*((vu8*)0x40003802))  // RW, UART2 FIFO control
#define R8_UART2_LCR        (*((vu8*)0x40003803))  // RW, UART2 line control
#define R32_UART2_STAT      (*((vu32*)0x40003804)) // RO, UART2 status
#define R8_UART2_IIR        (*((vu8*)0x40003804))  // RO, UART2 interrupt identification
#define R8_UART2_LSR        (*((vu8*)0x40003805))  // RO, UART2 line status
#define R32_UART2_FIFO      (*((vu32*)0x40003808)) // RW, UART2 data or FIFO port
#define R8_UART2_RBR        (*((vu8*)0x40003808))  // RO, UART2 receiver buffer, receiving byte
#define R8_UART2_THR        (*((vu8*)0x40003808))  // WO, UART2 transmitter holding, transmittal byte
#define R8_UART2_RFC        (*((vu8*)0x4000380A))  // RO, UART2 receiver FIFO count
#define R8_UART2_TFC        (*((vu8*)0x4000380B))  // RO, UART2 transmitter FIFO count
#define R32_UART2_SETUP     (*((vu32*)0x4000380C)) // RW, UART2 setup
#define R16_UART2_DL        (*((vu16*)0x4000380C)) // RW, UART2 divisor latch
#define R8_UART2_DLL        (*((vu8*)0x4000380C))  // RW, UART2 divisor latch LSB byte
#define R8_UART2_DLM        (*((vu8*)0x4000380D))  // RW, UART2 divisor latch MSB byte
#define R8_UART2_DIV        (*((vu8*)0x4000380E))  // RW, UART2 pre-divisor latch byte, only low 7 bit, from 1 to 0/128

